{
  "creeds": {
    "faithful": {
      "name": "Faithful",
      "description": "Religious and spiritual hunters who draw strength from belief and faith. They see the Hunt as a sacred calling.",
      "philosophy": "Faith is our shield and our weapon. We hunt not from hate, but from duty to protect the innocent.",
      "boosted_skills": ["insight", "medicine", "occult"],
      "typical_drives": ["atonement", "oath"],
      "color": "#4a90e2"
    },
    "inquisitive": {
      "name": "Inquisitive",
      "description": "Researchers, scientists, and investigators who approach the supernatural analytically. Knowledge is their greatest weapon.",
      "philosophy": "Understanding our enemy is the first step to defeating them. We hunt with information and preparation.",
      "boosted_skills": ["academics", "investigation", "science"],
      "typical_drives": ["curiosity", "greed"],
      "color": "#7b68ee"
    },
    "martial": {
      "name": "Martial",
      "description": "Soldiers, law enforcement, and fighters who confront supernatural threats with direct force and tactical expertise.",
      "philosophy": "When diplomacy fails, we stand ready. Superior firepower and training win hunts.",
      "boosted_skills": ["athletics", "brawl", "firearms"],
      "typical_drives": ["pride", "vengeance"],
      "color": "#dc3545"
    },
    "entrepreneurial": {
      "name": "Entrepreneurial",
      "description": "Networkers, fixers, and resource managers who leverage connections and capital against supernatural threats.",
      "philosophy": "Everything has a price, and we know how to pay it. Resources and contacts are as deadly as bullets.",
      "boosted_skills": ["finance", "persuasion", "streetwise"],
      "typical_drives": ["greed", "pride"],
      "color": "#ffc107"
    },
    "underground": {
      "name": "Underground",
      "description": "Street-level survivors, criminals, and outcasts who fight supernatural threats from society's shadows.",
      "philosophy": "The system failed us, so we hunt alone. Survival and cunning are our edges.",
      "boosted_skills": ["larceny", "stealth", "survival"],
      "typical_drives": ["vengeance", "atonement"],
      "color": "#ff8c00"
    }
  },
  "drives": {
    "curiosity": {
      "name": "Curiosity",
      "description": "The Hunter is motivated to discover everything about the quarry; learning about their target motivates them to dig deeper for each new fact.",
      "redemption": "The cell learns new information about their quarry."
    },
    "vengeance": {
      "name": "Vengeance",
      "description": "The Hunter must balance the scale for the harm done to themselves or someone close to them by the supernatural.",
      "redemption": "The cell must directly or indirectly harm their quarry (or a creature similar)."
    },
    "oath": {
      "name": "Oath",
      "description": "The Hunter's words are their bond, and they must fulfill the pledge they made against the creatures of the night, stopping at nothing to achieve this.",
      "redemption": "The cell must aid the Hunter to either uphold their pledge or bring it closer to completion."
    },
    "greed": {
      "name": "Greed",
      "description": "The Hunter wants what the supernatural creatures have, believing it unfair that they profit from their monstrosities.",
      "redemption": "Obtaining resources from the quarry or a creature like it."
    },
    "pride": {
      "name": "Pride",
      "description": "The Hunter has a burning desire to prove themselves against supernatural creatures given powers that they've never deserved. Whether it represents the unbreakable human spirit or an overly competitive nature, the Hunter will take any chance to overcome their quarry.",
      "redemption": "Directly or indirectly beating the quarry at some type of challenge."
    },
    "envy": {
      "name": "Envy",
      "description": "The Hunter wants to join the supernatural or die trying.",
      "redemption": "Either obtain samples of the source of the quarry's power or win their favor."
    },
    "atonement": {
      "name": "Atonement",
      "description": "The Hunter helped a monster in the past, knowingly or unknowingly, and now seeks restitution. They are aware that their acts have injured innocent people and are willing to put themselves in danger to repay this debt.",
      "redemption": "The cell must defend someone, directly or indirectly, from the quarry (or a similar creature) by putting themselves in danger and taking the hit for them. Alternately, the Hunter can atone for their transgression by helping a cellie."
    }
  },
  "skill_descriptions": {
    "insight": "Read people and situations, detect lies, understand motivations",
    "medicine": "Treat wounds, diagnose conditions, understand biology",
    "occult": "Knowledge of supernatural lore, rituals, and hidden truths",
    "academics": "Formal education, research skills, theoretical knowledge",
    "investigation": "Gather clues, follow leads, solve mysteries",
    "science": "Scientific method, empirical analysis, technical understanding",
    "athletics": "Physical fitness, running, climbing, swimming",
    "brawl": "Hand-to-hand combat, grappling, close quarters fighting",
    "firearms": "Shooting, gun maintenance, tactical firearm use",
    "finance": "Money management, investment, financial crimes",
    "persuasion": "Convince others, negotiate, influence decisions",
    "streetwise": "Urban survival, criminal contacts, black market",
    "larceny": "Lockpicking, breaking and entering, theft skills",
    "stealth": "Move silently, hide, avoid detection",
    "survival": "Wilderness skills, tracking, foraging, endurance"
  },
  "game_mechanics": {
    "drive_bonus": "When using a Drive-boosted skill in pursuit of your Drive, you may add Desperation dice to the roll.",
    "visual_indicator": "Drive-boosted skills are highlighted with the 🔶 icon and orange background gradient.",
    "desperation_mechanics": "Drive-boosted skills are the primary way hunters use Desperation dice without risking Despair."
  }
}
